## **T1-21. 구간 분할 Expected Question**

### 나이 구간 나누기

basic1 데이터 중 'age'컬럼 이상치를 제거하고, 동일한 개수로 나이 순으로 3그룹으로 나눈 뒤 각 그룹의 중앙값을 더하시오
(이상치는 음수(0포함), 소수점 값)
- data: basic1.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [31]:
import pandas as pd
import numpy as np

df = pd.read_csv('data/basic1.csv')
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[100 rows x 8 columns]

In [32]:
# age 칼럼 이상치 제거
df = df[df['age'] > 0]
df = df[df['age'] == np.ceil(df['age'])]
df

       id    age city    f1  f2   f3    f4         f5
0    id01    2.0   서울   NaN   0  NaN  ENFJ  91.297791
1    id02    9.0   서울  70.0   1  NaN  ENFJ  60.339826
2    id03   27.0   서울  61.0   1  NaN  ISTJ  17.252986
3    id04   75.0   서울   NaN   2  NaN  INFP  52.667078
4    id05   24.0   서울  85.0   2  NaN  ISFJ  29.269869
..    ...    ...  ...   ...  ..  ...   ...        ...
95   id96   92.0   경기  53.0   1  NaN  ENTJ  52.667078
96   id97  100.0   경기   NaN   0  NaN  INFP  67.886373
97   id98   39.0   경기  58.0   2  NaN  INFP  98.429899
98   id99    1.0   경기  47.0   0  NaN  ESFJ  97.381034
99  id100   47.0   경기  53.0   0  vip  ESFP  33.308999

[90 rows x 8 columns]

In [33]:
# 구간 분할 및 수량 비교
df['range'] = pd.qcut(df['age'], q=3, labels=['group1', 'group2', 'group3'])
df['range'].value_counts()

group1    30
group2    30
group3    30
Name: range, dtype: int64

In [34]:
# 각 그룹의 중앙값의 합
med1 = df[df['range']=='group1']['age'].median()
med2 = df[df['range']=='group3']['age'].median()
med3 = df[df['range']=='group2']['age'].median()
print(med1 + med2 + med3)

165.0

## **T1-22. Time-Series4 (Weekly data)**

주어진 데이터(basic2.csv)에서 주 단위 Sales의 합계를 구하고, 가장 큰 값을 가진 주와 작은 값을 가진 주의 차이를 구하시오(절대값)
- 데이터셋 : basic2.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [38]:
import pandas as pd

df = pd.read_csv('data/basic2.csv')
print(df.head())

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [40]:
# to_datetime, set_index, 주 단위 Sales의 합계
df['Date'] = pd.to_datetime(df['Date'])
df = df.set_index('Date')
df_w = df.resample('W').sum()
print(df_w.head())

               Sales       PV       UV  Events
Date
2022-01-02  22748304   401318   6710.0       1
2022-01-09  33373822  1148464  15189.0       2
2022-01-16  20754519   283773   9344.0       0
2022-01-23  21880751   538633   9841.0       1
2022-01-30  28878452   560814   7808.0       1

In [42]:
# 가장 큰 값을 가진 주 - 가장 작은 값을 가진 주 (절대값)
print(abs(df_w['Sales'].max() - df_w['Sales'].min()))

91639050

## **T1-24. Time-Series5 (Lagged Feature) 시차 데이터 생성**

주어진 데이터(basic2.csv)에서 새로운 컬럼(1일 이전 시차 컬럼)을 만들고, Events가 1이면서 Sales가 1000000이하인 조건에 맞는 새로운 컬럼 합을 구하시오
- 데이터셋 : basic2.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [4]:
import pandas as pd

df = pd.read_csv('data/basic2.csv')
print(df.head())

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [5]:
# 1일 차이가 나는 칼럼 생성
df['previous_PV'] = df['PV'].shift(1) # shift(1) = 밑으로 한 칸 내리기, shift(-1) = 위로 한 칸 올리기
print(df.head())

         Date     Sales      PV      UV  Events  previous_PV
0  2022-01-01  22711525  397349  4421.0       1          NaN
1  2022-01-02     36779    3969  2289.0       0     397349.0
2  2022-01-03  13943875  373890     NaN       1       3969.0
3  2022-01-04   8088593  142054  2157.0       0     373890.0
4  2022-01-05   2395374  190684     NaN       0     142054.0

In [9]:
# Events가 1이면서 Sales가 1,000,000이하인 조건에 맞는 새로운 칼럼 합
cond = (df['Events'] == 1) & (df['Sales'] <= 1000000)
print(df[cond]['previous_PV'].sum())

1894876.0